caAERS/software/jbi/caaers2adeers-sync/core-camel-su/src/test/resources/xslt/adeers/request/inbound_service_soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
  Copyright SemanticBits, Northwestern University and Akaza Research
  
  Distributed under the OSI-approved BSD 3-Clause License.
  See http://ncip.github.com/caaers/LICENSE.txt for details.
-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<gen:GenericRequest
			xmlns:gen="http://webservice.caaers.cabig.nci.nih.gov/GenericProcessor/">
			<payload>
				<system>adeers</system>
				<request>
					<!--Optional: -->
					<entity>agent</entity>
					<operation mode="async" name="getAgentsLOV">
						<criteria>
							<!--1 or more repetitions: -->
							<criterion name="createdDate">12-02-2002</criterion>
						</criteria>
					</operation>
				</request>
			</payload>
		</gen:GenericRequest>
	</soap:Body>
</soap:Envelope>
